dct = {
    'start': "Вітаю, це стартове меню твіттер-бота.\n"
             "Для початку роботи тобі потрібно пройти верифікацію",
    'profile': '🔘 Ваша анкета 🔘\n'
               '\n'
               '🔹Twitter ID: {}\n'
               '\n'
               'Натисніть кнопку з назвою пункту який хочете відредагувати\n'
               '\n'
               '❗️ Надсилайте заявку тільки якщо точно впевнені, що в анкеті все вказано правильно ❗️\n',
    'twitter_entry': '🌀 Введіть ваш Twitter ID 🌀\n'
                     '⚠️ Приклад: https://twitter.com/elonmusk\n'
                     '🔅 Це посилання на профіль Ілона Маска.\n'
                     '⚠️ Його Twitter ID: elonmusk\n'
                     '❕ На цьому прикладі введіть свій ID в чат.',
    'wait': '⏱ Ваша заявка на розгляді ⏱\n'
            'Будь ласка, чекайте на вердикт 💬',
    'users_apply': '⚠️ Запит користувача на перевірку ⚠️\n'
                   '\n'
                   '#️⃣ Заявка: {}\n'
                   '🔘 Username: {}\n'
                   '🔹Twitter:\n'
                   'https://twitter.com/{}\n',
    'users_apply_accepted': 'Запит користувача на перевірку\n'
                           '\n'
                           '#️ Заявка: {}\n'
                           '🔘 Username: {}\n'
                           '🔹Twitter:\n'
                           'https://twitter.com/{}\n'
                           '\n'
                           '✅СХВАЛЕНО✅',
    'users_apply_declined': 'Запит користувача на перевірку\n'
                            '\n'
                           '#️ Заявка: {}\n'
                           '🔹Twitter:\n'
                           'https://twitter.com/{}\n'
                           '\n'
                            '⛔️ВІДХИЛЕНО⛔️',
    'once_congrat_verif': '⭐️ Вітаємо ⭐️\n'
                          '❇️ Ви успішно пройшли верифікацію ❇️',
    'once_refusal_verif': '❗️ Вашу заявку на верифікацію відхилено ❗\n'
                          '🙏🏻 Не хвилюйтесь 🙏🏻\n'
                          'Ви можете відредагувати дані та спробувати знову 👍',
    'verif_menu': '❇️ Ви верифіковані ❇️\n'
                  '\n'
                  'Користуючись меню, виконуйте завдання від інших користувачів, або створюйте власні завдання для інших.\n'
                  '\n'
                  'Щоб створити власне завдання, спочатку потрібно виконати завдання від інших користувачів.\n',
    'bloced_user': '🚫 Ви були заблоковані. 🚫\nЗверніться до адміністраторів за інформацією.',
    'fill_order': 'Інструкція з виконання завдання:\n'
                  '\n'
                  '1) Натисність на кнопку з типом завдання;\n'
                  '\n'
                  '2) Бот відправить у чат лінк на завдання;\n'
                  '\n'
                  '3) Перейдіть за посиланням у твіттер;\n'
                  '\n'
                  '4) Виконайте усі умови вказані на кнопці\n'
                  '(На кнопці вказано що потрібно зробити)\n',
    'create_task': 'Інструкція з створення завдання:\n'
                   '\n'
                   '1) Натисніть на кнопку "Створити завдання";\n'
                   '\n'
                   '2) Введіть до чату посилання на ваше завдання у твіттері;\n'
                   '\n'
                   '3) Ваше завдання прийнято в роботу! 👍\n'
                   '\n'
                   '❗️ Ви можете створити 1 завдання, 1 раз на тиждень.',
    'link_entry': 'Напишіть у чат повне посилання яке веде на ваш пост у твіттері.\n'
                  '\n'
                  'Будьте уважні, приймаються лише посилання з твіттеру.\n'
                  '\n'
                  'Посилання на інші сайти - не приймаються.',
    'invalid_link': '♦️ Посилання не з твіттеру, перевірте його ще раз та спробуйте створити нове завдання.',
    'succ_create_order': '🟢 Завдання успішно створено. Скоро виконавці почнуть його виконувати.',
    'error_create_task': '⛔️ Нажаль ви поки не можете створювати нові завдання.',
    'order_notification_like': '⭐️ Ви отримали нове завдання ⭐️\n'
                          '\n'
                          'Завдання {}\n'
                          '\n'
                          '1) Натисніть на посилання нижче:\n'
                          '\n'
                          '2) Twitter: {}\n'
                          '\n'
                          '3) Ваше завдання зробити: ЛАЙК ❤️',
    'order_notification_like_repost': '⭐️ Ви отримали нове завдання ⭐️\n'
                               '\n'
                               'Завдання {}\n'
                               '\n'
                               '1) Натисніть на посилання нижче:\n'
                               '\n'
                               '2) Twitter: {}\n'
                               '\n'
                               '3) Ваше завдання зробити: ЛАЙК ❤️ + РЕПОСТ 🔁',
    'order_notification_like_com': '⭐️ Ви отримали нове завдання ⭐️\n'
                               '\n'
                               'Завдання {}\n'
                               '\n'
                               '1) Натисніть на посилання нижче:\n'
                               '\n'
                               '2) Twitter: {}\n'
                               '\n'
                               '3) Ваше завдання зробити: ЛАЙК ❤️ + КОМЕНТАР 💬\n',
    'update_create_status': "🔶🔸 Ви отримали можливість створити нове завдання 🔸🔶",
    'error_time_left': '🚫 Помилка 🚫\nДля запиту цієї команди, спочатку потрібно пройти верифікацію.',
    'time_left1': '⏳ До нової можливості створити завдання залишилось: {} днів',
    'time_left2': '⏳ До нової можливості створити завдання залишилось: {} дні',
    'time_left3': '⏳ До нової можливості створити завдання залишилось: {} день',
    'time_left4': '⏱ Нова можливість створити завдання буде надана сьогодні, очікуйте будь-ласка ⏱',
    'ava_order_create': '👍 На даний момент у вас є можливість створити нове завдання 👍',
    'dont_have_perm': '⛔️ У вас немає прав для використання цієї команди ⛔️',
    'ban_user': '🫡 Ви успішно заблокували користувача: {} 🫡',
    'unban_user': '🔑 Ви успішно розблокували користувача: {} 🔑',
    'del_task': '🔔 Ви успішно видалили завдання: {} 🔔',
    'complete_other_tasks': '❗️ Будь-ласка, виконайте усі завдання які ви отримали ❗️',
    'deacline_reason1': 'Ваша заявка на верифікацію відхилена.\nБудь-ласка, вкажіть ваш Twitter ID.',
    'deacline_reason2': 'Ваша заявка на верифікацію відхилена.\nБудь-ласка, вкажіть ваш Telegram Username.',
}

btn = {
    'start_apply': "Пройти верифікацію  🛂",
    'user_twitter': "🔵 Twitter ID 🔵",
    'start_menu': 'Початкове меню ↩️',
    'complete_apply': '✅ Відправити запит ✅',
    'cancel': 'Назад ↩️',
    'accept_app': 'Підтвердити ✅',
    'decline_app': 'Відхилити ⛔️',
    'contact': 'Почати чат 💬',
    'admin_contact': "💬 Чат з адміном 💬",
    'create_order': '🆕 Створити завдання 🆕',
    'like': 'Лайк ❤️',
    'like_repost': 'Лайк ❤️ + Репост 🔁',
    'like_com': 'Лайк ❤️ + Коментар 💬',
    'creation_of_task': 'Створити завдання 🌈',
    'back_to_verif_menu': 'Назад ↩️',
    'fullfill_order': '🔥 Завершити завдання 🔥',
    'decline_reason1': 'Twitter ID',
    'decline_reason2': 'Telegram Username',
}
